import type { Piece } from '../pages/home/components/hero/type';

import piece1 from '@/img/Android1.webp';
import piece2 from '@/img/Android2.webp';
import piece3 from '@/img/Android3.webp';
import piece4 from '@/img/Android4.webp';
import piece5 from '@/img/Android5.webp';
import piece6 from '@/img/Android6.webp';
import piece7 from '@/img/Android7.webp';
import piece8 from '@/img/Android8.webp';
import piece9 from '@/img/Android9.webp';

const piece: Piece[] = [
  {
    id: 1,
    preview: piece1,
    full: '/imgFullAnime/full1.webp',
    depth: 0.35,
    alt: 'piece1',
    text: 'Tali - це не просто бренд, це цілий світ, де кожен може знайти щось для себе. Наші колекції включають в себе різноманітні стилі та дизайни, які відображають індивідуальність та унікальність кожного клієнта. Від класичних до сучасних, від мінімалістичних до екстравагантних - у нас є все, щоб задовольнити найвибагливіший смак.',
  },
  {
    id: 2,
    preview: piece2,
    full: '/imgFullAnime/full2.webp',
    depth: 0.55,
    alt: 'piece2',
    text: 'Tali - це не просто бренд, це цілий світ, де кожен може знайти щось для себе. Наші колекції включають в себе різноманітні стилі та дизайни, які відображають індивідуальність та унікальність кожного клієнта. Від класичних до сучасних, від мінімалістичних до екстравагантних - у нас є все, щоб задовольнити найвибагливіший смак.',
  },
  {
    id: 3,
    preview: piece3,
    full: '/imgFullAnime/full3.webp',
    depth: 0.75,
    alt: 'piece3',
    text: 'Tali - це не просто бренд, це цілий світ, де кожен може знайти щось для себе. Наші колекції включають в себе різноманітні стилі та дизайни, які відображають індивідуальність та унікальність кожного клієнта. Від класичних до сучасних, від мінімалістичних до екстравагантних - у нас є все, щоб задовольнити найвибагливіший смак.',
  },
  {
    id: 4,
    preview: piece4,
    full: '/imgFullAnime/full4.webp',
    depth: 0.45,
    alt: 'piece4',
    text: 'Tali - це не просто бренд, це цілий світ, де кожен може знайти щось для себе. Наші колекції включають в себе різноманітні стилі та дизайни, які відображають індивідуальність та унікальність кожного клієнта. Від класичних до сучасних, від мінімалістичних до екстравагантних - у нас є все, щоб задовольнити найвибагливіший смак.',
  },
  {
    id: 5,
    preview: piece5,
    full: '/imgFullAnime/full5.webp',
    depth: 0.95,
    alt: 'piece5',
    text: 'Tali - це не просто бренд, це цілий світ, де кожен може знайти щось для себе. Наші колекції включають в себе різноманітні стилі та дизайни, які відображають індивідуальність та унікальність кожного клієнта. Від класичних до сучасних, від мін індивидуальностІ та унІкальнІсть кожного клІєнта. ВІд класичних до сучасних, вІд мІнІмалІстичних до екстравагантних - у нас є все, щоб задовольнити найвибагливІший смак.',
  },
  {
    id: 6,
    preview: piece6,
    full: '/imgFullAnime/full6.webp',
    depth: 0.6,
    alt: 'piece6',
    text: 'Tali - це не просто бренд, це цíлий свiт, де кожен може знайти щось для себе. Нашi колекцiї включають в себе рiзноманiтнi стилi тa дизайни, якi вiдображaють iндивidуальнiсть тa унIкальнiсть кожного клIєнта. ВIд класичних до сучасних, вIд мIнIмалIстичних до екстравагантних - у нас є все, щоб задовольнити найвибагливIший смак.',
  },
  {
    id: 7,
    preview: piece7,
    full: '/imgFullAnime/full7.webp',
    depth: 0.4,
    alt: 'piece7',
    text: 'Tali - це не просто бренд, це цíлий свiт, де кожен може знайти щось для себе. Нашi колекцiї включають в себе рiзноманiтn i стилi тa дизайни, яk i вiдображaють iндивidуальнiсть тa уnIкальнiсть кожного клIєnта. ВId класичних до сучасних, вId мInIмalIstичных до еkстравагантных - у нас є все, щоб задовольnити найвибагливIший смак.',
  },
  {
    id: 8,
    preview: piece8,
    full: '/imgFullAnime/full8.webp',
    depth: 0.7,
    alt: 'piece8',
    text: 'Tali - це не просто бренд, це цíлий свiт, де кожен можe знайти щось для себе. Нашi колекцiї включають в себe рiзноман_iтn i стил_i тa дизайни, яk i в_iдображaють iндивidуальн_iсть тa уn_Iкальн_iсть кожного кл_Iєnта. В_Id класичних до сучasних, в_Id м_In_Imal_Istичных до еkстравагантных - у нас є все, щоб задовольnити найвибаглив_Iший смак.',
  },
  {
    id: 9,
    preview: piece9,
    full: '/imgFullAnime/full9.webp',
    depth: 0.5,
    alt: 'piece9',
    text: 'Tali - це не просто бренд, це цíлий свiт, де кожен можe знайти щось для себе. Нашi колекцiї включають в себe рiзноман_iтn i стил_i тa дизайни, яk i в_iдображaють iндивidуальн_iсть тa уn_Iкальн_iсть кожного кл_Iєnта. В_Id класичних до сучasних, в_Id м_In_Imal_Istичных до еkстравагантных - у нас є все, щоб задовольnити найвибаглив_Iший смак.',
  },
];

export default piece;
